#pragma once
#include <iostream>
#include <string>
#include "../Commands/Unique.h"
//#include "XMLTextContent.h"
class XMLNode
{

public:
	virtual ~XMLNode() = default;
	virtual const std::string get_string() const = 0;
	virtual const std::string get_type() const = 0;
	virtual void generate_unique_ids(UniqueId& values) = 0;
	//ново
	virtual XMLNode* copy() = 0;

	//virtual void add_element_node(XMLNode* child) = 0;
	//virtual add_attributes()
};


// Как да опиша атрибутите какви да са те ? Как изобщо да започна ? Правилно ли почвам ?
//Нека засега да направим голямата четворка за всеки случай.
// Този клас със сигурност ще има наследници, деца, тоест ще ни трябва някъде да ги пазим. - Не няма да е тук.
// След още проучванене на хмл стигнах до извода, че ще ми трябва клас tag/етикет, атрибут и нещо за текст. 
//доста полезно:https://www.w3schools.com/xml/xml_tree.asp
//Стигнах до извода, че за да правя root и в последстиве наследници, първо трябва да се оправя с по-дребните неща.




//Да ги сапазвм в отделни папки да си направя

//И да сложа текста като отделен наследник на XMLRoot

//Успешно ги оделихме в отделни папки. Нека да започнем същинската работа.

//Оправихме конст и подаване по референция на някой функции.

//13.50 - текуща идея базовия клас, да е изцяло виртуален и да няма нищо в него да служи само като разпределител,
//кое къде да ходи.

//default - си създава въпреки всичко и default  конструктора. =0 задължително трябва да си го напишеш отделно.

// инклудовете ги слагаме там където ще ги ползваме.

//Исках да ги чета ред по ред, после любезно ми беше казано, че няма да как да се оправя така.
//СЪответно ще ги чета токен по токен. След като разбрах, че и принтирането може да е както аз искам.