#pragma once
#include <iostream>

class XMLRoot
{

public:

};

// Как да опиша атрибутите какви да са те ? Как изобщо да започна ? Правилно ли почвам ?
//Нека засега да направим голямата четворка за всеки случай.
// Този клас със сигурност ще има наследници, деца, тоест ще ни трябва някъде да ги пазим. - Не няма да е тук.
// След още проучванене на хмл стигнах до извода, че ще ми трябва клас tag/етикет, атрибут и нещо за текст. 
//доста полезно:https://www.w3schools.com/xml/xml_tree.asp
//Стигнах до извода, че за да правя root и в последстиве наследници, първо трябва да се оправя с по-дребните неща.